lib/tasks/scrape.rake

INSERT INTO "players" ("score", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", -7], ["name", "Viktor Hovland"], ["created_at", "2023-03-26 12:23:40.965406"], ["updated_at", "2023-03-26 12:23:40.965406"]]
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "J. Niemann"], ["LIMIT", 1]]
INSERT INTO "players" ("score", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", -7], ["name", "J.Rose"], ["created_at", "2021-04-10 08:29:56.177117"], ["updated_at", "2021-04-10 08:29:56.177117"]]
UPDATE "players" SET "score" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["score", -3], ["updated_at", "2022-04-03 17:25:12.501929"], ["id", 39]]
---
      name: name,
      score: player.children[4].text,
    }
    players_array << player
  end

  players_array.each do |player|
    this_player = Player.find_by(name: player[:name])
    if this_player.nil?
      Player.create(
        # place: player[:place],
        name: player[:name],
        score: player[:score]
      )
    else
      this_player.update(
        score: player[:score],
        name: player[:name]
      )