app/helpers/players_helper.rb

  def fetch_scores

    most_recent_update = Update.order(created_at: :desc).first

    if (most_recent_update == nil || most_recent_update.created_at < 1.minutes.ago)

      url = "https://www.espn.com/golf/leaderboard"
      unparsed_page = HTTParty.get(url)
      parsed_page = Nokogiri::HTML(unparsed_page)
      players_array = Array.new

      table = parsed_page.css('tbody.Table__TBODY')
      all_players = table.children

      all_players.each do |player|
        name = player.children[2].text
        player = {
          name: name,
          score: player.children[3].text,
        }
        players_array << player
      end

      players_array.each do |player|
        this_player = Player.find_by(name: player[:name])
---
SELECT  "updates".* FROM "updates" WHERE "updates"."created_at" = $1 ORDER BY "updates"."id" ASC LIMIT $2  [["created_at", "desc"], ["LIMIT", 1]]
INSERT INTO "players" ("score", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", -7], ["name", "Brooks Koepka"], ["created_at", "2023-03-26 21:22:38.479287"], ["updated_at", "2023-03-26 21:22:38.479287"]]
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "Brooks Koepka"], ["LIMIT", 1]]

            score: player[:score]
          )
        else
          this_player.update(
            score: player[:score],
            name: player[:name]
          )
        end
      end

      Update.create()
---
UPDATE "players" SET "score" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["score", 0], ["updated_at", "2023-03-26 21:42:42.384556"], ["id", 37]]
INSERT INTO "updates" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2023-03-26 21:38:21.044628"], ["updated_at", "2023-03-26 21:38:21.044628"]]