app/views/players/index.html.erb

  <h2><%=team.name%>, score: <%=team.total_score %></h2>
    <% team.players.each do |player|%>
---
SELECT "players".* FROM "players" INNER JOIN "players_teams" ON "players"."id" = "players_teams"."player_id" WHERE "players_teams"."team_id" = $1  [["team_id", 1]]