app/views/players/index.html.erb

      <h2><%=better.name%>, score: <%=better.total_score %></h2>
        <% better.players.each do |player|%>
---
SELECT "players".* FROM "players" INNER JOIN "betters_players" ON "players"."id" = "betters_players"."player_id" WHERE "betters_players"."better_id" = $1  [["better_id", 1]]