app/controllers/players_controller.rb

SELECT "betters".* FROM "betters"
---
  def index

    @all_betters = Better.all