app/controllers/players_controller.rb

  def index

    @all_teams = Team.all

    @all_players = Player.all
---
SELECT "teams".* FROM "teams"
SELECT "players".* FROM "players"