app/controllers/teams_controller.rb

SELECT "players".* FROM "players"
---
  def new
    @players = Player.all

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jack"], ["created_at", "2022-04-02 07:13:01.009407"], ["updated_at", "2022-04-02 07:13:01.009407"]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create

    new_team = Team.create(name: params["team"]["name"])
    params["team"]["players"].values.each do |player_index|
      player = Player.find(player_index)