app/models/better.rb

  def total_score
    array = []
    self.players.each do |player|
---
SELECT "players".* FROM "players" INNER JOIN "betters_players" ON "players"."id" = "betters_players"."player_id" WHERE "betters_players"."better_id" = $1  [["better_id", 1]]