app/models/team.rb

SELECT "players".* FROM "players" INNER JOIN "players_teams" ON "players"."id" = "players_teams"."player_id" WHERE "players_teams"."team_id" = $1  [["team_id", 1]]
---
  def total_score
    array = []
    self.players.each do |player|